---
kind: property
id: P:Autodesk.Revit.DB.FamilyManager.Types
source: html/048fbdd1-313f-209e-3046-25c8872bf04e.htm
---
# Autodesk.Revit.DB.FamilyManager.Types Property

All family types in the family.

## Syntax (C#)
```csharp
public FamilyTypeSet Types { get; }
```